tutorials/catalyticZonesReactingFoam/methanePartialOxidation/0.org/CH4
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      CH4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.55;

boundaryField
{
    "inlet.*"
    {
        type            fixedValue;
        value           uniform 0.55;
    }
    outlet
    {
        type            zeroGradient;
    }
    solid_inlet
    {
        type            zeroGradient;
    }
    walls
    {
        type            zeroGradient;
    }
    periodic1
    {
        type            cyclic;
    }
    periodic2
    {
        type            cyclic;
    }
}


// ************************************************************************* //
